<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Aggregating-and-Combining-pandas-DataFrames" data-toc-modified-id="Aggregating-and-Combining-pandas-DataFrames-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Aggregating and Combining <code>pandas</code> DataFrames</a></span><ul class="toc-item"><li><span><a href="#Learning-Goals" data-toc-modified-id="Learning-Goals-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Learning Goals</a></span><ul class="toc-item"><li><span><a href="#Austin-Animal-Center-Data" data-toc-modified-id="Austin-Animal-Center-Data-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Austin Animal Center Data</a></span></li></ul></li><li><span><a href="#Aggregating-over-DataFrames:-.groupby()" data-toc-modified-id="Aggregating-over-DataFrames:-.groupby()-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Aggregating over DataFrames: <code>.groupby()</code></a></span><ul class="toc-item"><li><span><a href="#.groups-and-.get_group()" data-toc-modified-id=".groups-and-.get_group()-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span><code>.groups</code> and <code>.get_group()</code></a></span><ul class="toc-item"><li><span><a href="#Multi-Indexing" data-toc-modified-id="Multi-Indexing-1.2.1.1"><span class="toc-item-num">1.2.1.1&nbsp;&nbsp;</span>Multi-Indexing</a></span></li></ul></li><li><span><a href="#Aggregating" data-toc-modified-id="Aggregating-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Aggregating</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Pivoting-a-DataFrame" data-toc-modified-id="Pivoting-a-DataFrame-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Pivoting a DataFrame</a></span><ul class="toc-item"><li><span><a href="#.pivot_table()" data-toc-modified-id=".pivot_table()-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span><code>.pivot_table()</code></a></span><ul class="toc-item"><li><span><a href="#Example" data-toc-modified-id="Example-1.3.1.1"><span class="toc-item-num">1.3.1.1&nbsp;&nbsp;</span>Example</a></span></li><li><span><a href="#Back-to-Austin-animals" data-toc-modified-id="Back-to-Austin-animals-1.3.1.2"><span class="toc-item-num">1.3.1.2&nbsp;&nbsp;</span>Back to Austin animals</a></span></li></ul></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()" data-toc-modified-id="Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Methods for Combining DataFrames: <code>.join()</code>, <code>.merge()</code>, <code>pd.concat()</code></a></span><ul class="toc-item"><li><span><a href="#.join()" data-toc-modified-id=".join()-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span><code>.join()</code></a></span></li><li><span><a href="#.merge()" data-toc-modified-id=".merge()-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span><code>.merge()</code></a></span></li><li><span><a href="#The-how-Parameter" data-toc-modified-id="The-how-Parameter-1.4.3"><span class="toc-item-num">1.4.3&nbsp;&nbsp;</span>The <code>how</code> Parameter</a></span></li><li><span><a href="#pd.concat()" data-toc-modified-id="pd.concat()-1.4.4"><span class="toc-item-num">1.4.4&nbsp;&nbsp;</span><code>pd.concat()</code></a></span></li><li><span><a href="#EXTRA" data-toc-modified-id="EXTRA-1.4.5"><span class="toc-item-num">1.4.5&nbsp;&nbsp;</span>EXTRA</a></span></li></ul></li><li><span><a href="#King-County-Assessments" data-toc-modified-id="King-County-Assessments-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>King County Assessments</a></span><ul class="toc-item"><li><span><a href="#First,-get-the-data!" data-toc-modified-id="First,-get-the-data!-1.5.1"><span class="toc-item-num">1.5.1&nbsp;&nbsp;</span>First, get the data!</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.5.2"><span class="toc-item-num">1.5.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Time-Permitting:-Data-Cleaning-with-Pandas" data-toc-modified-id="Time-Permitting:-Data-Cleaning-with-Pandas-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Time Permitting: Data Cleaning with Pandas</a></span><ul class="toc-item"><li><span><a href="#1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns." data-toc-modified-id="1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns.-1.6.1"><span class="toc-item-num">1.6.1&nbsp;&nbsp;</span>1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.</a></span></li><li><span><a href="#2.-Investigate-and-handle-non-numeric-ZipCode-values" data-toc-modified-id="2.-Investigate-and-handle-non-numeric-ZipCode-values-1.6.2"><span class="toc-item-num">1.6.2&nbsp;&nbsp;</span>2. Investigate and handle non-numeric ZipCode values</a></span></li><li><span><a href="#3.-Add-a-column-for-PricePerSqFt" data-toc-modified-id="3.-Add-a-column-for-PricePerSqFt-1.6.3"><span class="toc-item-num">1.6.3&nbsp;&nbsp;</span>3. Add a column for PricePerSqFt</a></span></li><li><span><a href="#4.-Subset-the-data-to-2021-sales-only." data-toc-modified-id="4.-Subset-the-data-to-2021-sales-only.-1.6.4"><span class="toc-item-num">1.6.4&nbsp;&nbsp;</span>4. Subset the data to 2021 sales only.</a></span></li><li><span><a href="#5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?" data-toc-modified-id="5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?-1.6.5"><span class="toc-item-num">1.6.5&nbsp;&nbsp;</span>5. What is the mean price per square foot for a house sold in Seattle in 2021?</a></span></li></ul></li><li><span><a href="#Level-Up:-pandas.set_option()" data-toc-modified-id="Level-Up:-pandas.set_option()-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Level Up: <code>pandas.set_option()</code></a></span><ul class="toc-item"><li><span><a href="#Block-Scientific-Notation" data-toc-modified-id="Block-Scientific-Notation-1.7.1"><span class="toc-item-num">1.7.1&nbsp;&nbsp;</span>Block Scientific Notation</a></span></li><li><span><a href="#See-More-Rows" data-toc-modified-id="See-More-Rows-1.7.2"><span class="toc-item-num">1.7.2&nbsp;&nbsp;</span>See More Rows</a></span></li></ul></li></ul></li></ul></div>

# Aggregating and Combining `pandas` DataFrames

In [1]:
import pandas as pd
import numpy as np
import requests as rq
from sklearn.preprocessing import OneHotEncoder
from zipfile import ZipFile

## Learning Goals

- Use GroupBy objects to organize and aggregate data
- Create pivot tables from DataFrames
- Combine DataFrames by merging and appending

We'll work with the Austin Animal Center dataset and with data from King County's Department of Assessments (Seattle housing data).

### Austin Animal Center Data

In [2]:
data = rq.get('https://data.austintexas.gov/resource/9t4d-g238.json').text

In [3]:
animals = pd.read_json(data)

/var/folders/0y/79r5lggs18d69s42s6p76mrw0000gn/T/ipykernel_14783/2013551082.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  animals = pd.read_json(data)

In [5]:
animals.head()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
0,A882831,*Hamilton,2023-07-01 18:12:00,2023-07-01T18:12:00.000,2023-03-25T00:00:00.000,Adoption,Cat,Neutered Male,3 months,Domestic Shorthair Mix,Black/White,NaN
1,A794011,Chunk,2019-05-08 18:20:00,2019-05-08T18:20:00.000,2017-05-02T00:00:00.000,Rto-Adopt,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White,NaN
2,A776359,Gizmo,2018-07-18 16:02:00,2018-07-18T16:02:00.000,2017-07-12T00:00:00.000,Adoption,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown,NaN
3,A821648,NaN,2020-08-16 11:38:00,2020-08-16T11:38:00.000,2019-08-16T00:00:00.000,Euthanasia,Other,Unknown,1 year,Raccoon,Gray,NaN
4,A720371,Moose,2016-02-13 17:59:00,2016-02-13T17:59:00.000,2015-10-08T00:00:00.000,Adoption,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,NaN

## Aggregating over DataFrames: `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. (And if you haven't, you'll see it very soon!) Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [6]:
animals.groupby('animal_type')

In [7]:
animals.columns

Index(['animal_id', 'name', 'datetime', 'monthyear', 'date_of_birth',
       'outcome_type', 'animal_type', 'sex_upon_outcome', 'age_upon_outcome',
       'breed', 'color', 'outcome_subtype'],
      dtype='object')

We can group by multiple columns, and also return a DataFrameGroupBy object

Notice the object type [DataFrameGroupBy](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) object.

### `.groups` and `.get_group()`

In [8]:
animals.groupby(['animal_type', 'outcome_type'])

In [9]:
# This retuns each group indexed by the group name: 
# I.E. 'Bird', along with the row indices of each value
animals.groupby('animal_type').groups

{'Bird': [143, 257, 660], 'Cat': [0, 1, 5, 8, 9, 10, 11, 13, 14, 15, 18, 19, 21, 22, 23, 24, 25, 27, 30, 31, 33, 37, 39, 47, 50, 62, 65, 73, 76, 88, 89, 90, 92, 98, 102, 105, 108, 109, 113, 115, 116, 118, 120, 121, 123, 124, 128, 142, 145, 146, 147, 148, 149, 151, 153, 154, 159, 167, 173, 174, 176, 178, 179, 180, 183, 185, 186, 189, 190, 191, 194, 195, 196, 200, 203, 206, 207, 209, 212, 213, 218, 220, 227, 231, 236, 237, 239, 241, 242, 245, 248, 250, 252, 253, 254, 258, 263, 266, 267, 270, ...], 'Dog': [2, 4, 6, 7, 12, 16, 17, 20, 26, 29, 32, 34, 35, 36, 38, 41, 42, 43, 44, 45, 48, 49, 51, 52, 54, 55, 56, 57, 58, 60, 61, 63, 64, 66, 67, 68, 69, 70, 71, 74, 75, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 91, 95, 96, 97, 99, 101, 103, 104, 106, 107, 110, 111, 112, 114, 117, 119, 122, 125, 126, 127, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 144, 150, 152, 155, 156, 157, 158, 160, 161, 162, 163, 164, 165, 166, 168, 169, ...], 'Other': [3, 28, 40, 46, 53, 59, 72, 93, 94, 100, 129, 188, 214, 219, 228, 295, 304, 318, 330, 352, 371, 372, 428, 502, 508, 509, 520, 529, 593, 622, 623, 648, 658, 673, 703, 713, 714, 751, 754, 785, 791, 880, 888, 899, 911, 919, 942, 947, 953]}

Once we know we are working with a type of object, it opens up a suite of attributes and methods. One attribute we can look at is groups.

In [10]:
# Once we know the group indices, we can return the groups using those indices.
animals.groupby('animal_type').get_group('Dog')

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
2,A776359,Gizmo,2018-07-18 16:02:00,2018-07-18T16:02:00.000,2017-07-12T00:00:00.000,Adoption,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown,NaN
4,A720371,Moose,2016-02-13 17:59:00,2016-02-13T17:59:00.000,2015-10-08T00:00:00.000,Adoption,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,NaN
6,A659412,Princess,2020-10-05 14:37:00,2020-10-05T14:37:00.000,2013-03-24T00:00:00.000,Adoption,Dog,Spayed Female,7 years,Chihuahua Shorthair Mix,Brown,NaN
7,A814515,Quentin,2020-05-06 07:59:00,2020-05-06T07:59:00.000,2018-03-01T00:00:00.000,Adoption,Dog,Neutered Male,2 years,American Foxhound/Labrador Retriever,White/Brown,Foster
12,A840370,Tulip,2021-08-19 19:36:00,2021-08-19T19:36:00.000,2019-08-06T00:00:00.000,Adoption,Dog,Spayed Female,2 years,Border Collie/Cardigan Welsh Corgi,Black/White,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
990,A907773,Fang,2024-07-18 16:39:00,2024-07-18T16:39:00.000,2021-06-20T00:00:00.000,Adoption,Dog,Neutered Male,3 years,Siberian Husky,Red/Tan,NaN
991,A809787,Banjo,2020-02-07 18:15:00,2020-02-07T18:15:00.000,2019-02-01T00:00:00.000,Adoption,Dog,Neutered Male,1 year,Australian Cattle Dog,Red/White,Foster
992,A718888,*Pearl,2016-01-13 16:30:00,2016-01-13T16:30:00.000,2015-07-09T00:00:00.000,Adoption,Dog,Spayed Female,6 months,German Shepherd Mix,Black/Tan,NaN
996,A846258,Baby,2021-11-16 12:20:00,2021-11-16T12:20:00.000,2019-11-12T00:00:00.000,Transfer,Dog,Intact Male,2 years,Shih Tzu/Chihuahua Shorthair,White,Partner
998,A679302,*Austin,2014-05-25 11:29:00,2014-05-25T11:29:00.000,2013-05-19T00:00:00.000,Transfer,Dog,Neutered Male,1 year,Chihuahua Shorthair/Dachshund Wirehair,Tan,Partner

How would you get the same dataframe using dataframe slicing?

#### Multi-Indexing

In [11]:
# Same goes for multi index groupbys
animal_outcome = animals.groupby(['animal_type', 'outcome_type'])
animal_outcome.groups

{('Bird', 'Adoption'): [257, 660], ('Bird', 'Died'): [143], ('Cat', 'Adoption'): [0, 8, 9, 10, 11, 23, 24, 30, 31, 33, 39, 62, 73, 76, 89, 92, 105, 108, 109, 113, 115, 118, 123, 124, 128, 149, 151, 167, 173, 176, 179, 180, 185, 189, 190, 191, 194, 196, 200, 203, 206, 209, 220, 227, 231, 237, 239, 241, 248, 250, 252, 253, 254, 258, 263, 271, 281, 285, 288, 307, 312, 314, 322, 326, 333, 334, 335, 341, 343, 347, 348, 351, 354, 357, 360, 363, 367, 370, 373, 381, 383, 393, 398, 403, 405, 407, 408, 412, 414, 416, 431, 437, 452, 454, 463, 465, 468, 471, 476, 484, ...], ('Cat', 'Died'): [65, 364, 551, 590, 837, 862], ('Cat', 'Disposal'): [571, 644], ('Cat', 'Euthanasia'): [22, 27, 47, 147, 148, 212, 284, 353, 382, 423, 466, 475, 556, 557, 649, 708, 712, 997], ('Cat', 'Return to Owner'): [15, 98, 120, 186, 378, 418, 550, 653, 700, 706, 725, 929, 995], ('Cat', 'Rto-Adopt'): [1, 376, 507], ('Cat', 'Transfer'): [5, 13, 14, 18, 19, 21, 25, 37, 50, 88, 90, 102, 116, 121, 142, 145, 146, 153, 154, 159, 174, 178, 183, 195, 207, 213, 218, 236, 242, 245, 266, 267, 270, 275, 299, 301, 306, 319, 320, 328, 344, 350, 379, 394, 397, 404, 436, 446, 447, 449, 451, 453, 456, 457, 461, 462, 469, 473, 474, 478, 481, 493, 505, 513, 516, 521, 539, 554, 558, 567, 575, 576, 592, 601, 606, 613, 617, 619, 626, 629, 634, 635, 642, 675, 681, 686, 689, 690, 695, 709, 717, 719, 722, 728, 737, 752, 753, 756, 764, 768, ...], ('Dog', 'Adoption'): [2, 4, 6, 7, 12, 26, 32, 41, 43, 44, 45, 48, 52, 55, 57, 58, 60, 61, 64, 69, 71, 74, 75, 77, 79, 80, 83, 84, 86, 91, 95, 97, 99, 106, 107, 110, 114, 117, 122, 125, 126, 130, 131, 133, 135, 139, 140, 144, 150, 152, 158, 160, 161, 166, 169, 170, 172, 177, 182, 187, 197, 199, 201, 202, 204, 208, 210, 215, 216, 224, 229, 233, 235, 238, 240, 243, 246, 247, 251, 259, 262, 264, 268, 269, 274, 276, 277, 278, 280, 286, 289, 291, 292, 293, 297, 302, 305, 310, 311, 315, ...], ('Dog', 'Died'): [101, 409, 419, 514, 534], ('Dog', 'Euthanasia'): [66, 175, 193, 536, 544, 688, 692], ('Dog', 'Return to Owner'): [16, 20, 29, 35, 36, 38, 42, 49, 51, 68, 78, 81, 82, 87, 103, 104, 111, 112, 119, 127, 138, 141, 157, 162, 163, 164, 165, 168, 205, 211, 223, 226, 230, 244, 249, 255, 256, 261, 265, 283, 298, 300, 303, 308, 324, 325, 327, 331, 332, 342, 346, 358, 377, 384, 386, 390, 395, 415, 425, 433, 438, 439, 459, 460, 470, 489, 497, 501, 504, 517, 532, 537, 538, 552, 578, 580, 585, 591, 604, 607, 611, 624, 638, 641, 645, 657, 662, 670, 677, 680, 684, 716, 723, 724, 726, 731, 757, 758, 765, 779, ...], ('Dog', 'Rto-Adopt'): [63, 136, 137, 272, 294, 426, 488, 697, 760, 935], ('Dog', 'Transfer'): [17, 34, 54, 56, 67, 70, 85, 96, 132, 134, 155, 156, 171, 181, 184, 192, 198, 217, 221, 222, 225, 232, 234, 260, 273, 279, 282, 287, 290, 296, 309, 313, 338, 339, 356, 359, 362, 368, 369, 387, 389, 402, 420, 421, 435, 442, 448, 455, 464, 467, 472, 483, 485, 498, 500, 506, 512, 522, 524, 535, 542, 545, 553, 565, 586, 587, 599, 600, 605, 609, 615, 616, 625, 636, 647, 654, 664, 667, 672, 682, 691, 696, 729, 730, 733, 743, 744, 747, 748, 789, 806, 813, 817, 834, 844, 845, 850, 858, 859, 864, ...], ('Other', 'Adoption'): [59, 318, 529, 658], ('Other', 'Died'): [304, 330, 953], ('Other', 'Disposal'): [295, 352], ('Other', 'Euthanasia'): [3, 28, 40, 46, 53, 72, 93, 94, 100, 129, 188, 214, 371, 372, 428, 502, 520, 593, 622, 623, 673, 713, 714, 751, 754, 785, 791, 880, 888, 899, 911], ('Other', 'Return to Owner'): [648], ('Other', 'Transfer'): [219, 228, 508, 509, 703, 919, 942, 947]}

In [12]:
# animal_outcome.groups is a dictionary, so we can access the group names using keys()
animal_outcome.groups.keys()

dict_keys([('Bird', 'Adoption'), ('Bird', 'Died'), ('Cat', 'Adoption'), ('Cat', 'Died'), ('Cat', 'Disposal'), ('Cat', 'Euthanasia'), ('Cat', 'Return to Owner'), ('Cat', 'Rto-Adopt'), ('Cat', 'Transfer'), ('Dog', 'Adoption'), ('Dog', 'Died'), ('Dog', 'Euthanasia'), ('Dog', 'Return to Owner'), ('Dog', 'Rto-Adopt'), ('Dog', 'Transfer'), ('Other', 'Adoption'), ('Other', 'Died'), ('Other', 'Disposal'), ('Other', 'Euthanasia'), ('Other', 'Return to Owner'), ('Other', 'Transfer')])

In [13]:
# We can then get a specific group, such as Cats that were adopted
animal_outcome.get_group(('Cat', 'Adoption'))

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
0,A882831,*Hamilton,2023-07-01 18:12:00,2023-07-01T18:12:00.000,2023-03-25T00:00:00.000,Adoption,Cat,Neutered Male,3 months,Domestic Shorthair Mix,Black/White,NaN
8,A902098,NaN,2024-07-18 12:07:00,2024-07-18T12:07:00.000,2024-04-10T00:00:00.000,Adoption,Cat,Neutered Male,3 months,Domestic Shorthair,Blue Tabby,Foster
9,A860161,*Lalo,2022-07-19 15:53:00,2022-07-19T15:53:00.000,2022-05-04T00:00:00.000,Adoption,Cat,Neutered Male,2 months,Domestic Shorthair,Brown Tabby,NaN
10,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18T18:52:00.000,2014-08-01T00:00:00.000,Adoption,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,NaN
11,A680969,*Zeus,2014-08-05 16:59:00,2014-08-05T16:59:00.000,2014-06-03T00:00:00.000,Adoption,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
977,A850162,*Angelina Purrline,2022-01-25 16:35:00,2022-01-25T16:35:00.000,2021-01-19T00:00:00.000,Adoption,Cat,Spayed Female,1 year,Domestic Medium Hair,Brown Tabby/White,NaN
980,A729191,*Mr. Jones,2016-07-17 17:13:00,2016-07-17T17:13:00.000,2016-05-14T00:00:00.000,Adoption,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Brown Tabby,NaN
989,A738723,*Celene,2016-12-09 09:20:00,2016-12-09T09:20:00.000,2016-10-11T00:00:00.000,Adoption,Cat,Spayed Female,1 month,Domestic Shorthair,Tortie,Foster
993,A727613,NaN,2016-06-30 17:15:00,2016-06-30T17:15:00.000,2016-03-23T00:00:00.000,Adoption,Cat,Neutered Male,3 months,Domestic Shorthair Mix,Torbie,NaN
999,A798956,Lola,2019-08-12 16:01:00,2019-08-12T16:01:00.000,2019-05-02T00:00:00.000,Adoption,Cat,Spayed Female,3 months,Domestic Shorthair Mix,Black,NaN

### Aggregating

Once again, as we will see in SQL, groupby objects are intended to be used with aggregation. In SQL, we will see that our queries that include GROUP BY require aggregation performed on columns.

We can use `.sum()`, `.mean()`, `.count()`, `.max()`, `.min()`, etc. Find a list of common aggregations [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html).

In [14]:
animals.groupby('animal_type').count()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
animal_type,,,,,,,,,,,
Bird,3,3,3,3,3,3,3,3,3,3,1
Cat,378,235,378,378,378,378,378,378,378,378,229
Dog,570,492,570,570,570,570,570,570,570,570,190
Other,49,11,49,49,49,49,49,49,49,49,38

### Exercise

Use `.groupby()` to find the most recently born of each (main) animal type.

In [17]:
animals.groupby('animal_type')['date_of_birth'].max()

animal_type
Bird     2022-04-18T00:00:00.000
Cat      2024-07-11T00:00:00.000
Dog      2024-04-19T00:00:00.000
Other    2023-10-28T00:00:00.000
Name: date_of_birth, dtype: object

<details>
    <summary>Answer</summary>
    <code>animals.groupby('animal_type')['date_of_birth'].max()</code>
    </details>

## Pivoting a DataFrame

### `.pivot_table()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

Grouping by two different columns can be very helpful.

In [18]:
animals.groupby(by=['outcome_type', 'sex_upon_outcome']).agg(len)

                                  animal_id  name  datetime  monthyear  \
outcome_type    sex_upon_outcome
Adoption        Intact Female            12    12        12         12
                Intact Male              11    11        11         11
                Neutered Male           258   258       258        258
                Spayed Female           222   222       222        222
                Unknown                   1     1         1          1
Died            Intact Female             3     3         3          3
                Intact Male               3     3         3          3
                Neutered Male             1     1         1          1
                Spayed Female             2     2         2          2
                Unknown                   6     6         6          6
Disposal        Intact Male               1     1         1          1
                Unknown                   3     3         3          3
Euthanasia      Intact Female             7     7         7          7
                Intact Male               8     8         8          8
                Neutered Male             4     4         4          4
                Spayed Female             2     2         2          2
                Unknown                  35    35        35         35
Return to Owner Intact Female            21    21        21         21
                Intact Male              34    34        34         34
                Neutered Male            49    49        49         49
                Spayed Female            41    41        41         41
Rto-Adopt       Neutered Male             6     6         6          6
                Spayed Female             7     7         7          7
Transfer        Intact Female            82    82        82         82
                Intact Male              79    79        79         79
                Neutered Male            40    40        40         40
                Spayed Female            35    35        35         35
                Unknown                  27    27        27         27

                                  date_of_birth  animal_type  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                12           12
                Intact Male                  11           11
                Neutered Male               258          258
                Spayed Female               222          222
                Unknown                       1            1
Died            Intact Female                 3            3
                Intact Male                   3            3
                Neutered Male                 1            1
                Spayed Female                 2            2
                Unknown                       6            6
Disposal        Intact Male                   1            1
                Unknown                       3            3
Euthanasia      Intact Female                 7            7
                Intact Male                   8            8
                Neutered Male                 4            4
                Spayed Female                 2            2
                Unknown                      35           35
Return to Owner Intact Female                21           21
                Intact Male                  34           34
                Neutered Male                49           49
                Spayed Female                41           41
Rto-Adopt       Neutered Male                 6            6
                Spayed Female                 7            7
Transfer        Intact Female                82           82
                Intact Male                  79           79
                Neutered Male                40           40
                Spayed Female                35           35
                Unknown                      27           27

                                  age_upon_outcome  breed  color  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                   12     12     12
                Intact Male                     11     11     11
                Neutered Male                  258    258    258
                Spayed Female                  222    222    222
                Unknown                          1      1      1
Died            Intact Female                    3      3      3
                Intact Male                      3      3      3
                Neutered Male                    1      1      1
                Spayed Female                    2      2      2
                Unknown                          6      6      6
Disposal        Intact Male                      1      1      1
                Unknown                          3      3      3
Euthanasia      Intact Female                    7      7      7
                Intact Male                      8      8      8
                Neutered Male                    4      4      4
                Spayed Female                    2      2      2
                Unknown                         35     35     35
Return to Owner Intact Female                   21     21     21
                Intact Male                     34     34     34
                Neutered Male                   49     49     49
                Spayed Female                   41     41     41
Rto-Adopt       Neutered Male                    6      6      6
                Spayed Female                    7      7      7
Transfer        Intact Female                   82     82     82
                Intact Male                     79     79     79
                Neutered Male                   40     40     40
                Spayed Female                   35     35     35
                Unknown                         27     27     27

                                  outcome_subtype
outcome_type    sex_upon_outcome
Adoption        Intact Female                  12
                Intact Male                    11
                Neutered Male                 258
                Spayed Female                 222
                Unknown                         1
Died            Intact Female                   3
                Intact Male                     3
                Neutered Male                   1
                Spayed Female                   2
                Unknown                         6
Disposal        Intact Male                     1
                Unknown                         3
Euthanasia      Intact Female                   7
                Intact Male                     8
                Neutered Male                   4
                Spayed Female                   2
                Unknown                        35
Return to Owner Intact Female                  21
                Intact Male                    34
                Neutered Male                  49
                Spayed Female                  41
Rto-Adopt       Neutered Male                   6
                Spayed Female                   7
Transfer        Intact Female                  82
                Intact Male                    79
                Neutered Male                  40
                Spayed Female                  35
                Unknown                        27

But it has the unsavory side effect of creating a two-level index. This can be a good time to use `.pivot_table()`.

(There is also a `.pivot()`. For the somewhat subtle differences, see [here](https://stackoverflow.com/questions/30960338/pandas-difference-between-pivot-and-pivot-table-why-is-only-pivot-table-workin).)

#### Example

In [19]:
df = pd.DataFrame({"sex": ["male", "male", "male", "male", "male",
                          "female", "female", "female", "female"],
                    "num_puppies": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "breed": ["terrier", "retriever", "retriever", "terrier",
                          "terrier", "retriever", "terrier", "terrier",
                          "retriever"],
                    "past_owners": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "family_members": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

      sex num_puppies      breed  past_owners  family_members
0    male         one    terrier            1               2
1    male         one  retriever            2               4
2    male         one  retriever            2               5
3    male         two    terrier            3               5
4    male         two    terrier            3               6
5  female         one  retriever            4               6
6  female         one    terrier            5               8
7  female         two    terrier            6               9
8  female         two  retriever            7               9

In [20]:
# This first example aggregates values by taking the sum.

table = pd.pivot_table(df, values='past_owners', index=['sex', 'num_puppies'],
                     columns=['breed'], aggfunc=np.sum)
table

/var/folders/0y/79r5lggs18d69s42s6p76mrw0000gn/T/ipykernel_14783/2599897908.py:3: FutureWarning: The provided callable <function sum at 0x113b04940> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  table = pd.pivot_table(df, values='past_owners', index=['sex', 'num_puppies'],

breed               retriever  terrier
sex    num_puppies
female one                4.0      5.0
       two                7.0      6.0
male   one                4.0      1.0
       two                NaN      6.0

#### Back to Austin animals

In [21]:
animals.pivot_table(index='outcome_type', columns='sex_upon_outcome', aggfunc=len)

                 age_upon_outcome                                          \
sex_upon_outcome    Intact Female Intact Male Neutered Male Spayed Female
outcome_type
Adoption                     12.0        11.0         258.0         222.0
Died                          3.0         3.0           1.0           2.0
Disposal                      NaN         1.0           NaN           NaN
Euthanasia                    7.0         8.0           4.0           2.0
Return to Owner              21.0        34.0          49.0          41.0
Rto-Adopt                     NaN         NaN           6.0           7.0
Transfer                     82.0        79.0          40.0          35.0

                             animal_id                            \
sex_upon_outcome Unknown Intact Female Intact Male Neutered Male
outcome_type
Adoption             1.0          12.0        11.0         258.0
Died                 6.0           3.0         3.0           1.0
Disposal             3.0           NaN         1.0           NaN
Euthanasia          35.0           7.0         8.0           4.0
Return to Owner      NaN          21.0        34.0          49.0
Rto-Adopt            NaN           NaN         NaN           6.0
Transfer            27.0          82.0        79.0          40.0

                                        ...          name              \
sex_upon_outcome Spayed Female Unknown  ... Intact Female Intact Male
outcome_type                            ...
Adoption                 222.0     1.0  ...          12.0        11.0
Died                       2.0     6.0  ...           3.0         3.0
Disposal                   NaN     3.0  ...           NaN         1.0
Euthanasia                 2.0    35.0  ...           7.0         8.0
Return to Owner           41.0     NaN  ...          21.0        34.0
Rto-Adopt                  7.0     NaN  ...           NaN         NaN
Transfer                  35.0    27.0  ...          82.0        79.0

                                                     outcome_subtype  \
sex_upon_outcome Neutered Male Spayed Female Unknown   Intact Female
outcome_type
Adoption                 258.0         222.0     1.0            12.0
Died                       1.0           2.0     6.0             3.0
Disposal                   NaN           NaN     3.0             NaN
Euthanasia                 4.0           2.0    35.0             7.0
Return to Owner           49.0          41.0     NaN            21.0
Rto-Adopt                  6.0           7.0     NaN             NaN
Transfer                  40.0          35.0    27.0            82.0


sex_upon_outcome Intact Male Neutered Male Spayed Female Unknown
outcome_type
Adoption                11.0         258.0         222.0     1.0
Died                     3.0           1.0           2.0     6.0
Disposal                 1.0           NaN           NaN     3.0
Euthanasia               8.0           4.0           2.0    35.0
Return to Owner         34.0          49.0          41.0     NaN
Rto-Adopt                NaN           6.0           7.0     NaN
Transfer                79.0          40.0          35.0    27.0

[7 rows x 50 columns]

### Exercise

Use `.pivot_table()` to add up the number of my tasks by category. Hint: Use `sum()` as your aggregating function.

In [22]:
tasks = pd.DataFrame({'category': ['house', 'house', 'school', 'school'],
                      'descr': ['kitchen', 'laundry', 'git', 'Python'],
                      'priority': [2, 3, 4, 1], 'num_tasks': [2, 1, 2, 3]})

tasks

  category    descr  priority  num_tasks
0    house  kitchen         2          2
1    house  laundry         3          1
2   school      git         4          2
3   school   Python         1          3

In [23]:
tasks.pivot_table(values='num_tasks',index='category',aggfunc=sum)

/var/folders/0y/79r5lggs18d69s42s6p76mrw0000gn/T/ipykernel_14783/1488125588.py:1: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  tasks.pivot_table(values='num_tasks',index='category',aggfunc=sum)

          num_tasks
category
house             3
school            5

<details>
    <summary>Answer</summary>
    <code>tasks.pivot_table(values='num_tasks', index='category', aggfunc=sum)</code>
    </details>

## Methods for Combining DataFrames: `.join()`, `.merge()`, `pd.concat()`

### `.join()`

In [24]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'MP'])

toy1

   age   HP
0   63  142
1   33   47

In [25]:
toy2

   age   MP
0   63  100
1   33  200

In [26]:
# We can't just join these as they are, since we haven't specified our suffixes.

toy1.join(toy2)

ValueError: columns overlap but no suffix specified: Index(['age'], dtype='object')

In [27]:
toy1.join(toy2, lsuffix='1', rsuffix='2')

   age1   HP  age2   MP
0    63  142    63  100
1    33   47    33  200

If we don't want to keep both, we could set the overlapping column as the index in each DataFrame:

In [28]:
toy1.set_index('age').join(toy2.set_index('age'))

      HP   MP
age
63   142  100
33    47  200

For more on this method, check out the [doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html)!

### `.merge()`

Or we could use `.merge()`:

In [29]:
toy1.merge(toy2)

   age   HP   MP
0   63  142  100
1   33   47  200

In [31]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [32]:
states = pd.read_csv('data/states.csv', index_col=0)
states

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

### The `how` Parameter

This parameter in both `.join()` and `.merge()` tells the compiler what sort of join to effect. We'll cover this in detail when we discuss SQL.

In [33]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  alison  300         DC    DC   district  Washington
4  rachel  200         TX    TX      alamo      Austin

In [34]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='outer')

     name     HP home_state state   nickname     capital
0  alison  300.0         DC    DC   district  Washington
1     NaN    NaN        NaN    OH    buckeye    Columbus
2     NaN    NaN        NaN    OR     beaver       Salem
3    alan  170.0         TX    TX      alamo      Austin
4  rachel  200.0         TX    TX      alamo      Austin
5    greg  200.0         WA    WA  evergreen     Olympia
6   miles  200.0         WA    WA  evergreen     Olympia

### `pd.concat()`

This method takes a *list* of pandas objects as arguments.

In [37]:
ds_full = pd.concat([ds_chars, states])
ds_full

     name     HP home_state state   nickname     capital
0    greg  200.0         WA   NaN        NaN         NaN
1   miles  200.0         WA   NaN        NaN         NaN
2    alan  170.0         TX   NaN        NaN         NaN
3  alison  300.0         DC   NaN        NaN         NaN
4  rachel  200.0         TX   NaN        NaN         NaN
0     NaN    NaN        NaN    WA  evergreen     Olympia
1     NaN    NaN        NaN    TX      alamo      Austin
2     NaN    NaN        NaN    DC   district  Washington
3     NaN    NaN        NaN    OH    buckeye    Columbus
4     NaN    NaN        NaN    OR     beaver       Salem

`pd.concat()`–– and many other pandas operations –– make use of an `axis` parameter. For this particular method I need to specify whether I want to concatenate the DataFrames *row-wise* (`axis=0`) or *column-wise* (`axis=1`). The default is `axis=0`, so let's override that!

In [38]:
ds_full = pd.concat([ds_chars, states], axis=1)
ds_full

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    TX      alamo      Austin
2    alan  170         TX    DC   district  Washington
3  alison  300         DC    OH    buckeye    Columbus
4  rachel  200         TX    OR     beaver       Salem

### EXTRA

## King County Assessments

As data scientists, we want to build a model to predict the sale price of a house in Seattle in 2019, based on its square footage. We know that the King County Department of Assessments has comprehensive data available on real property sales in the Seattle area. We need to prepare the data.

### First, get the data!

Go [here](https://info.kingcounty.gov/assessor/DataDownload/default.aspx) and download two files: "Real Property Sales" and "Residential Building". Then unzip them. (Or you can run the cells below if you prefer.)

In [40]:
%%bash
cd data
curl -o property_sales.zip https://aqua.kingcounty.gov/extranet/assessor/Real%20Property%20Sales.zip

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100  137M  100  137M    0     0  1550k      0  0:01:30  0:01:30 --:--:-- 1284k

In [41]:
%%bash
cd data
curl -o res_bldg.zip https://aqua.kingcounty.gov/extranet/assessor/Residential%20Building.zip

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 20.9M  100 20.9M    0     0  1539k      0  0:00:13  0:00:13 --:--:-- 1611k

In [42]:
zf = ZipFile('data/property_sales.zip', 'r')
zf.extractall('data')
zf.close()

In [43]:
zf = ZipFile('data/res_bldg.zip', 'r')
zf.extractall('data')
zf.close()

In [44]:
# You'll need to use a new encoding here. List of all encodings here:
# https://docs.python.org/3/library/codecs.html#standard-encodings

# Both of these csv files have many columns, so we'll just pre-select
# which ones we want to use.

sales_df = pd.read_csv('data/EXTR_RPSale.csv',
                       encoding='latin-1',
                       usecols=['Major', 'Minor', 'DocumentDate', 'SalePrice'])

/var/folders/0y/79r5lggs18d69s42s6p76mrw0000gn/T/ipykernel_14783/1290808690.py:7: DtypeWarning: Columns (1,2) have mixed types. Specify dtype option on import or set low_memory=False.
  sales_df = pd.read_csv('data/EXTR_RPSale.csv',

In [45]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2342275 entries, 0 to 2342274
Data columns (total 4 columns):
 #   Column        Dtype
---  ------        -----
 0   Major         object
 1   Minor         object
 2   DocumentDate  object
 3   SalePrice     int64
dtypes: int64(1), object(3)
memory usage: 71.5+ MB

In [46]:
bldg_df = pd.read_csv('data/EXTR_ResBldg.csv',
                     usecols=['Major', 'Minor', 'SqFtTotLiving', 'ZipCode'])

/var/folders/0y/79r5lggs18d69s42s6p76mrw0000gn/T/ipykernel_14783/4051920166.py:1: DtypeWarning: Columns (11) have mixed types. Specify dtype option on import or set low_memory=False.
  bldg_df = pd.read_csv('data/EXTR_ResBldg.csv',

In [47]:
bldg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 528584 entries, 0 to 528583
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Major          528584 non-null  int64
 1   Minor          528584 non-null  int64
 2   ZipCode        473833 non-null  object
 3   SqFtTotLiving  528584 non-null  int64
dtypes: int64(3), object(1)
memory usage: 16.1+ MB

In [48]:
sales_data = pd.merge(sales_df, bldg_df, on=['Major', 'Minor'])

In [49]:
sales_data.head()

    Major Minor DocumentDate  SalePrice  ZipCode  SqFtTotLiving
0    4000   228   04/29/1997     103500    98168           1560
1  160460  1802   12/14/2021     775000      NaN           2160
2  282607  9118   08/20/1992     147000    98014           1780
3  438800   480   05/02/2005          0    98023           1540
4  947850   590   11/06/2012     205343  98042.0           1690

In [50]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1634481 entries, 0 to 1634480
Data columns (total 6 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   Major          1634481 non-null  object
 1   Minor          1634481 non-null  object
 2   DocumentDate   1634481 non-null  object
 3   SalePrice      1634481 non-null  int64
 4   ZipCode        1480892 non-null  object
 5   SqFtTotLiving  1634481 non-null  int64
dtypes: int64(2), object(4)
memory usage: 74.8+ MB

We can see right away that we're missing ZIP codes for many of the sales transactions.

In [51]:
sales_data.loc[sales_data['ZipCode'].isna()].head()

     Major Minor DocumentDate  SalePrice ZipCode  SqFtTotLiving
1   160460  1802   12/14/2021     775000     NaN           2160
6   873300    95   08/20/2020     720000     NaN           2910
14   27200   130   05/19/1998      92000     NaN           2150
41  952655   120   12/18/2012     661448     NaN           2970
47   32507  9024   09/29/2000          0     NaN           6350

### Exercise

What percentage of housing records are missing ZIP codes?

In [63]:
na_zipcode = (sales_data['ZipCode'].isna().sum() / len(sales_data['ZipCode'])) * 100
na_zipcode

9.396805469136686

<details>
    <summary>Answer</summary>
    <code>sales_data['ZipCode'].isna().sum() / sales_data.shape[0]</code>
    </details>

Let's drop the rows with missing zip codes.

In [64]:
sales_data = sales_data.loc[~sales_data['ZipCode'].isna(), :]
#sales_data2 = sales_data[~sales_data['ZipCode'].isna()]
sales_data

          Major Minor DocumentDate  SalePrice  ZipCode  SqFtTotLiving
0          4000   228   04/29/1997     103500    98168           1560
2        282607  9118   08/20/1992     147000    98014           1780
3        438800   480   05/02/2005          0    98023           1540
4        947850   590   11/06/2012     205343  98042.0           1690
5        222006  9039   05/16/2016     250000    98022            720
...         ...   ...          ...        ...      ...            ...
1634476  386090    75   01/25/2018    3988888    98004           5590
1634477  954720  2120   01/26/2005          0  98115.0           2700
1634478    5100   220   03/22/2013     308750    98023           2670
1634479  144180    60   02/04/2002     251450    98034           1480
1634480  558140   380   03/24/1994      92500    98074           3130

[1480892 rows x 6 columns]

## Time Permitting: Data Cleaning with Pandas

### 1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.

In [69]:
sales_data = sales_data[sales_data['SalePrice'] > 10000]
sales_data = sales_data[sales_data['SqFtTotLiving'] > 500]

In [70]:
sales_data

          Major Minor DocumentDate  SalePrice  ZipCode  SqFtTotLiving
0          4000   228   04/29/1997     103500    98168           1560
2        282607  9118   08/20/1992     147000    98014           1780
4        947850   590   11/06/2012     205343  98042.0           1690
5        222006  9039   05/16/2016     250000    98022            720
7        762220    85   10/13/2016     650000    98116           2100
...         ...   ...          ...        ...      ...            ...
1634475  403750   340   04/26/2007     440000    98008           2140
1634476  386090    75   01/25/2018    3988888    98004           5590
1634478    5100   220   03/22/2013     308750    98023           2670
1634479  144180    60   02/04/2002     251450    98034           1480
1634480  558140   380   03/24/1994      92500    98074           3130

[959743 rows x 6 columns]

<details>
    <summary>One possible answer here</summary>
    <code>sales_data = sales_data[sales_data['SalePrice'] > 10000]</code>
    </details>

### 2. Investigate and handle non-numeric ZipCode values

Can you find a way to shorten ZIP+4 codes to the first five digits?

In [71]:
def is_integer(x):
    try:
        _ = int(x)
    except ValueError:
        return False
    return True

sales_data.loc[sales_data['ZipCode'].apply(is_integer) == False, 'ZipCode'].head()

2819     98199-3014
8400     98042-3001
12397    98031-3173
18699    98033-4917
34964    98058-9018
Name: ZipCode, dtype: object

In [73]:
def five_digits(x):
    try:
        return int(str(x)[:5])
    except:
        return x

sales_data['ZipCode'] = sales_data['ZipCode'].map(five_digits)
sales_data = sales_data.loc[sales_data['ZipCode'].apply(is_integer) == True, :]
sales_data['ZipCode'] = sales_data['ZipCode'].map(int)

/var/folders/0y/79r5lggs18d69s42s6p76mrw0000gn/T/ipykernel_14783/1351783154.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_data['ZipCode'] = sales_data['ZipCode'].map(int)

In [74]:
sales_data

          Major Minor DocumentDate  SalePrice  ZipCode  SqFtTotLiving
0          4000   228   04/29/1997     103500    98168           1560
2        282607  9118   08/20/1992     147000    98014           1780
4        947850   590   11/06/2012     205343    98042           1690
5        222006  9039   05/16/2016     250000    98022            720
7        762220    85   10/13/2016     650000    98116           2100
...         ...   ...          ...        ...      ...            ...
1634475  403750   340   04/26/2007     440000    98008           2140
1634476  386090    75   01/25/2018    3988888    98004           5590
1634478    5100   220   03/22/2013     308750    98023           2670
1634479  144180    60   02/04/2002     251450    98034           1480
1634480  558140   380   03/24/1994      92500    98074           3130

[959733 rows x 6 columns]

<details>
    <summary>One possible answer here</summary>
    <code>def five_digit_ZIP(x):
    try:
        return int(str(x)[:5])
    except:
        return x
sales_data['ZipCode'] = sales_data['ZipCode'].map(five_digit_ZIP)
sales_data = sales_data.loc[sales_data['ZipCode'].apply(is_integer) == True, :]
sales_data['ZipCode'] = sales_data['ZipCode'].map(int)</code>
    </details>

### 3. Add a column for PricePerSqFt

In [75]:
sales_data['PricePerSqFt'] = sales_data['SalePrice'] / sales_data['SqFtTotLiving']

/var/folders/0y/79r5lggs18d69s42s6p76mrw0000gn/T/ipykernel_14783/671559162.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_data['PricePerSqFt'] = sales_data['SalePrice'] / sales_data['SqFtTotLiving']

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'] = sales_data['SalePrice'] / sales_data['SqFtTotLiving']</code>
    </details>

### 4. Subset the data to 2021 sales only.

We can assume that the DocumentDate is approximately the sale date.

In [77]:
sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])
sales_data = sales_data.loc[sales_data['DocumentDate'] > '12/31/2020']

/var/folders/0y/79r5lggs18d69s42s6p76mrw0000gn/T/ipykernel_14783/2692763730.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])

<details>
    <summary>Answer here</summary>
    <code>sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])
sales_data = sales_data.loc[sales_data['DocumentDate'] > '12/31/2020']</code>
    </details>

### 5. What is the mean price per square foot for a house sold in Seattle in 2021?

In [81]:
sales_data['PricePerSqFt'].mean()

530.8669503446201

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'].mean()</code>
    </details>

## Level Up: `pandas.set_option()`

We can adjust how `pandas` works by setting options in advance.

### Block Scientific Notation

For example, suppose we want to prevent numbers from being displayed in scientific notation.

In [82]:
df = pd.DataFrame([[1e9, 2e9], [3e9, 4e9]])
df

              0             1
0  1.000000e+09  2.000000e+09
1  3.000000e+09  4.000000e+09

Then we can use:

In [83]:
pd.set_option('display.float_format', '{:.2f}'.format)

df

              0             1
0 1000000000.00 2000000000.00
1 3000000000.00 4000000000.00

### See More Rows

Or suppose we want `pandas` to show more rows.

In [84]:
df2 = pd.DataFrame(np.array(range(100)))
df2

     0
0    0
1    1
2    2
3    3
4    4
..  ..
95  95
96  96
97  97
98  98
99  99

[100 rows x 1 columns]

In that case we can use:

In [85]:
pd.set_option('display.max_rows', 100)

df2

     0
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10
11  11
12  12
13  13
14  14
15  15
16  16
17  17
18  18
19  19
20  20
21  21
22  22
23  23
24  24
25  25
26  26
27  27
28  28
29  29
30  30
31  31
32  32
33  33
34  34
35  35
36  36
37  37
38  38
39  39
40  40
41  41
42  42
43  43
44  44
45  45
46  46
47  47
48  48
49  49
50  50
51  51
52  52
53  53
54  54
55  55
56  56
57  57
58  58
59  59
60  60
61  61
62  62
63  63
64  64
65  65
66  66
67  67
68  68
69  69
70  70
71  71
72  72
73  73
74  74
75  75
76  76
77  77
78  78
79  79
80  80
81  81
82  82
83  83
84  84
85  85
86  86
87  87
88  88
89  89
90  90
91  91
92  92
93  93
94  94
95  95
96  96
97  97
98  98
99  99

For complete documentation, see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html).